GopalSaraf/Practicals/PSDL/include/proc/pic18f15q41.inc
// Register: SPI2STATUS
#define SPI2STATUS SPI2STATUS
SPI2STATUS                               equ 0094h
// bitfield definitions
SPI2STATUS_RXBF_POSN                     equ 0000h
SPI2STATUS_RXBF_POSITION                 equ 0000h
SPI2STATUS_RXBF_SIZE                     equ 0001h
SPI2STATUS_RXBF_LENGTH                   equ 0001h
SPI2STATUS_RXBF_MASK                     equ 0001h
SPI2STATUS_CLRBF_POSN                    equ 0002h
SPI2STATUS_CLRBF_POSITION                equ 0002h
SPI2STATUS_CLRBF_SIZE                    equ 0001h
SPI2STATUS_CLRBF_LENGTH                  equ 0001h
SPI2STATUS_CLRBF_MASK                    equ 0004h
SPI2STATUS_RXRE_POSN                     equ 0003h
SPI2STATUS_RXRE_POSITION                 equ 0003h
SPI2STATUS_RXRE_SIZE                     equ 0001h
SPI2STATUS_RXRE_LENGTH                   equ 0001h
SPI2STATUS_RXRE_MASK                     equ 0008h
SPI2STATUS_TXBE_POSN                     equ 0005h
SPI2STATUS_TXBE_POSITION                 equ 0005h
SPI2STATUS_TXBE_SIZE                     equ 0001h
SPI2STATUS_TXBE_LENGTH                   equ 0001h
SPI2STATUS_TXBE_MASK                     equ 0020h
SPI2STATUS_TXWE_POSN                     equ 0007h
SPI2STATUS_TXWE_POSITION                 equ 0007h
SPI2STATUS_TXWE_SIZE                     equ 0001h
SPI2STATUS_TXWE_LENGTH                   equ 0001h
SPI2STATUS_TXWE_MASK                     equ 0080h
SPI2STATUS_SPI2RXBF_POSN                 equ 0000h
SPI2STATUS_SPI2RXBF_POSITION             equ 0000h
SPI2STATUS_SPI2RXBF_SIZE                 equ 0001h
SPI2STATUS_SPI2RXBF_LENGTH               equ 0001h
SPI2STATUS_SPI2RXBF_MASK                 equ 0001h
SPI2STATUS_SPI2CLRBF_POSN                equ 0002h
SPI2STATUS_SPI2CLRBF_POSITION            equ 0002h
SPI2STATUS_SPI2CLRBF_SIZE                equ 0001h
SPI2STATUS_SPI2CLRBF_LENGTH              equ 0001h
SPI2STATUS_SPI2CLRBF_MASK                equ 0004h
SPI2STATUS_SPI2RXRE_POSN                 equ 0003h
SPI2STATUS_SPI2RXRE_POSITION             equ 0003h
SPI2STATUS_SPI2RXRE_SIZE                 equ 0001h
SPI2STATUS_SPI2RXRE_LENGTH               equ 0001h
SPI2STATUS_SPI2RXRE_MASK                 equ 0008h
SPI2STATUS_SPI2TXBE_POSN                 equ 0005h
SPI2STATUS_SPI2TXBE_POSITION             equ 0005h
SPI2STATUS_SPI2TXBE_SIZE                 equ 0001h
SPI2STATUS_SPI2TXBE_LENGTH               equ 0001h
SPI2STATUS_SPI2TXBE_MASK                 equ 0020h
SPI2STATUS_SPI2TXWE_POSN                 equ 0007h
SPI2STATUS_SPI2TXWE_POSITION             equ 0007h
SPI2STATUS_SPI2TXWE_SIZE                 equ 0001h
SPI2STATUS_SPI2TXWE_LENGTH               equ 0001h
SPI2STATUS_SPI2TXWE_MASK                 equ 0080h

// Register: SPI2TWIDTH
#define SPI2TWIDTH SPI2TWIDTH
SPI2TWIDTH                               equ 0095h
// bitfield definitions
SPI2TWIDTH_TWIDTH_POSN                   equ 0000h
SPI2TWIDTH_TWIDTH_POSITION               equ 0000h
SPI2TWIDTH_TWIDTH_SIZE                   equ 0003h
SPI2TWIDTH_TWIDTH_LENGTH                 equ 0003h
SPI2TWIDTH_TWIDTH_MASK                   equ 0007h
SPI2TWIDTH_TWIDTH0_POSN                  equ 0000h
SPI2TWIDTH_TWIDTH0_POSITION              equ 0000h
SPI2TWIDTH_TWIDTH0_SIZE                  equ 0001h
SPI2TWIDTH_TWIDTH0_LENGTH                equ 0001h
SPI2TWIDTH_TWIDTH0_MASK                  equ 0001h
SPI2TWIDTH_TWIDTH1_POSN                  equ 0001h
SPI2TWIDTH_TWIDTH1_POSITION              equ 0001h
SPI2TWIDTH_TWIDTH1_SIZE                  equ 0001h
SPI2TWIDTH_TWIDTH1_LENGTH                equ 0001h
SPI2TWIDTH_TWIDTH1_MASK                  equ 0002h
SPI2TWIDTH_TWIDTH2_POSN                  equ 0002h
SPI2TWIDTH_TWIDTH2_POSITION              equ 0002h
SPI2TWIDTH_TWIDTH2_SIZE                  equ 0001h
SPI2TWIDTH_TWIDTH2_LENGTH                equ 0001h
SPI2TWIDTH_TWIDTH2_MASK                  equ 0004h

// Register: SPI2BAUD
#define SPI2BAUD SPI2BAUD
SPI2BAUD                                 equ 0096h
// bitfield definitions
SPI2BAUD_BAUD_POSN                       equ 0000h
SPI2BAUD_BAUD_POSITION                   equ 0000h
SPI2BAUD_BAUD_SIZE                       equ 0008h
SPI2BAUD_BAUD_LENGTH                     equ 0008h
SPI2BAUD_BAUD_MASK                       equ 00FFh
SPI2BAUD_BAUD0_POSN                      equ 0000h
SPI2BAUD_BAUD0_POSITION                  equ 0000h
SPI2BAUD_BAUD0_SIZE                      equ 0001h
SPI2BAUD_BAUD0_LENGTH                    equ 0001h
SPI2BAUD_BAUD0_MASK                      equ 0001h
SPI2BAUD_BAUD1_POSN                      equ 0001h
SPI2BAUD_BAUD1_POSITION                  equ 0001h
SPI2BAUD_BAUD1_SIZE                      equ 0001h
SPI2BAUD_BAUD1_LENGTH                    equ 0001h
SPI2BAUD_BAUD1_MASK                      equ 0002h
SPI2BAUD_BAUD2_POSN                      equ 0002h
SPI2BAUD_BAUD2_POSITION                  equ 0002h
SPI2BAUD_BAUD2_SIZE                      equ 0001h
SPI2BAUD_BAUD2_LENGTH                    equ 0001h
SPI2BAUD_BAUD2_MASK                      equ 0004h
SPI2BAUD_BAUD3_POSN                      equ 0003h
SPI2BAUD_BAUD3_POSITION                  equ 0003h
SPI2BAUD_BAUD3_SIZE                      equ 0001h
SPI2BAUD_BAUD3_LENGTH                    equ 0001h
SPI2BAUD_BAUD3_MASK                      equ 0008h
SPI2BAUD_BAUD4_POSN                      equ 0004h
SPI2BAUD_BAUD4_POSITION                  equ 0004h
SPI2BAUD_BAUD4_SIZE                      equ 0001h
SPI2BAUD_BAUD4_LENGTH                    equ 0001h
SPI2BAUD_BAUD4_MASK                      equ 0010h
SPI2BAUD_BAUD5_POSN                      equ 0005h
SPI2BAUD_BAUD5_POSITION                  equ 0005h
SPI2BAUD_BAUD5_SIZE                      equ 0001h
SPI2BAUD_BAUD5_LENGTH                    equ 0001h
SPI2BAUD_BAUD5_MASK                      equ 0020h
SPI2BAUD_BAUD6_POSN                      equ 0006h
SPI2BAUD_BAUD6_POSITION                  equ 0006h
SPI2BAUD_BAUD6_SIZE                      equ 0001h
SPI2BAUD_BAUD6_LENGTH                    equ 0001h
SPI2BAUD_BAUD6_MASK                      equ 0040h
SPI2BAUD_BAUD7_POSN                      equ 0007h
SPI2BAUD_BAUD7_POSITION                  equ 0007h
SPI2BAUD_BAUD7_SIZE                      equ 0001h
SPI2BAUD_BAUD7_LENGTH                    equ 0001h
SPI2BAUD_BAUD7_MASK                      equ 0080h

