GopalSaraf/Practicals/PSDL/include/proc/pic18f15q41.inc
// Register: OSCCON1
#define OSCCON1 OSCCON1
OSCCON1                                  equ 00ADh
// bitfield definitions
OSCCON1_NDIV_POSN                        equ 0000h
OSCCON1_NDIV_POSITION                    equ 0000h
OSCCON1_NDIV_SIZE                        equ 0004h
OSCCON1_NDIV_LENGTH                      equ 0004h
OSCCON1_NDIV_MASK                        equ 000Fh
OSCCON1_NOSC_POSN                        equ 0004h
OSCCON1_NOSC_POSITION                    equ 0004h
OSCCON1_NOSC_SIZE                        equ 0003h
OSCCON1_NOSC_LENGTH                      equ 0003h
OSCCON1_NOSC_MASK                        equ 0070h
OSCCON1_NDIV0_POSN                       equ 0000h
OSCCON1_NDIV0_POSITION                   equ 0000h
OSCCON1_NDIV0_SIZE                       equ 0001h
OSCCON1_NDIV0_LENGTH                     equ 0001h
OSCCON1_NDIV0_MASK                       equ 0001h
OSCCON1_NDIV1_POSN                       equ 0001h
OSCCON1_NDIV1_POSITION                   equ 0001h
OSCCON1_NDIV1_SIZE                       equ 0001h
OSCCON1_NDIV1_LENGTH                     equ 0001h
OSCCON1_NDIV1_MASK                       equ 0002h
OSCCON1_NDIV2_POSN                       equ 0002h
OSCCON1_NDIV2_POSITION                   equ 0002h
OSCCON1_NDIV2_SIZE                       equ 0001h
OSCCON1_NDIV2_LENGTH                     equ 0001h
OSCCON1_NDIV2_MASK                       equ 0004h
OSCCON1_NDIV3_POSN                       equ 0003h
OSCCON1_NDIV3_POSITION                   equ 0003h
OSCCON1_NDIV3_SIZE                       equ 0001h
OSCCON1_NDIV3_LENGTH                     equ 0001h
OSCCON1_NDIV3_MASK                       equ 0008h
OSCCON1_NOSC0_POSN                       equ 0004h
OSCCON1_NOSC0_POSITION                   equ 0004h
OSCCON1_NOSC0_SIZE                       equ 0001h
OSCCON1_NOSC0_LENGTH                     equ 0001h
OSCCON1_NOSC0_MASK                       equ 0010h
OSCCON1_NOSC1_POSN                       equ 0005h
OSCCON1_NOSC1_POSITION                   equ 0005h
OSCCON1_NOSC1_SIZE                       equ 0001h
OSCCON1_NOSC1_LENGTH                     equ 0001h
OSCCON1_NOSC1_MASK                       equ 0020h
OSCCON1_NOSC2_POSN                       equ 0006h
OSCCON1_NOSC2_POSITION                   equ 0006h
OSCCON1_NOSC2_SIZE                       equ 0001h
OSCCON1_NOSC2_LENGTH                     equ 0001h
OSCCON1_NOSC2_MASK                       equ 0040h

// Register: OSCCON2
#define OSCCON2 OSCCON2
OSCCON2                                  equ 00AEh
// bitfield definitions
OSCCON2_CDIV_POSN                        equ 0000h
OSCCON2_CDIV_POSITION                    equ 0000h
OSCCON2_CDIV_SIZE                        equ 0004h
OSCCON2_CDIV_LENGTH                      equ 0004h
OSCCON2_CDIV_MASK                        equ 000Fh
OSCCON2_COSC_POSN                        equ 0004h
OSCCON2_COSC_POSITION                    equ 0004h
OSCCON2_COSC_SIZE                        equ 0003h
OSCCON2_COSC_LENGTH                      equ 0003h
OSCCON2_COSC_MASK                        equ 0070h
OSCCON2_CDIV0_POSN                       equ 0000h
OSCCON2_CDIV0_POSITION                   equ 0000h
OSCCON2_CDIV0_SIZE                       equ 0001h
OSCCON2_CDIV0_LENGTH                     equ 0001h
OSCCON2_CDIV0_MASK                       equ 0001h
OSCCON2_CDIV1_POSN                       equ 0001h
OSCCON2_CDIV1_POSITION                   equ 0001h
OSCCON2_CDIV1_SIZE                       equ 0001h
OSCCON2_CDIV1_LENGTH                     equ 0001h
OSCCON2_CDIV1_MASK                       equ 0002h
OSCCON2_CDIV2_POSN                       equ 0002h
OSCCON2_CDIV2_POSITION                   equ 0002h
OSCCON2_CDIV2_SIZE                       equ 0001h
OSCCON2_CDIV2_LENGTH                     equ 0001h
OSCCON2_CDIV2_MASK                       equ 0004h
OSCCON2_CDIV3_POSN                       equ 0003h
OSCCON2_CDIV3_POSITION                   equ 0003h
OSCCON2_CDIV3_SIZE                       equ 0001h
OSCCON2_CDIV3_LENGTH                     equ 0001h
OSCCON2_CDIV3_MASK                       equ 0008h
OSCCON2_COSC0_POSN                       equ 0004h
OSCCON2_COSC0_POSITION                   equ 0004h
OSCCON2_COSC0_SIZE                       equ 0001h
OSCCON2_COSC0_LENGTH                     equ 0001h
OSCCON2_COSC0_MASK                       equ 0010h
OSCCON2_COSC1_POSN                       equ 0005h
OSCCON2_COSC1_POSITION                   equ 0005h
OSCCON2_COSC1_SIZE                       equ 0001h
OSCCON2_COSC1_LENGTH                     equ 0001h
OSCCON2_COSC1_MASK                       equ 0020h
OSCCON2_COSC2_POSN                       equ 0006h
OSCCON2_COSC2_POSITION                   equ 0006h
OSCCON2_COSC2_SIZE                       equ 0001h
OSCCON2_COSC2_LENGTH                     equ 0001h
OSCCON2_COSC2_MASK                       equ 0040h

// Register: OSCCON3
#define OSCCON3 OSCCON3
OSCCON3                                  equ 00AFh
// bitfield definitions
OSCCON3_NOSCR_POSN                       equ 0003h
OSCCON3_NOSCR_POSITION                   equ 0003h
OSCCON3_NOSCR_SIZE                       equ 0001h
OSCCON3_NOSCR_LENGTH                     equ 0001h
OSCCON3_NOSCR_MASK                       equ 0008h
OSCCON3_ORDY_POSN                        equ 0004h
OSCCON3_ORDY_POSITION                    equ 0004h
OSCCON3_ORDY_SIZE                        equ 0001h
OSCCON3_ORDY_LENGTH                      equ 0001h
OSCCON3_ORDY_MASK                        equ 0010h
OSCCON3_SOSCPWR_POSN                     equ 0006h
OSCCON3_SOSCPWR_POSITION                 equ 0006h
OSCCON3_SOSCPWR_SIZE                     equ 0001h
OSCCON3_SOSCPWR_LENGTH                   equ 0001h
OSCCON3_SOSCPWR_MASK                     equ 0040h
OSCCON3_CSWHOLD_POSN                     equ 0007h
OSCCON3_CSWHOLD_POSITION                 equ 0007h
OSCCON3_CSWHOLD_SIZE                     equ 0001h
OSCCON3_CSWHOLD_LENGTH                   equ 0001h
OSCCON3_CSWHOLD_MASK                     equ 0080h

// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 00B0h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 00B1h
// bitfield definitions
OSCFRQ_HFFRQ_POSN                        equ 0000h
OSCFRQ_HFFRQ_POSITION                    equ 0000h
OSCFRQ_HFFRQ_SIZE                        equ 0004h
OSCFRQ_HFFRQ_LENGTH                      equ 0004h
OSCFRQ_HFFRQ_MASK                        equ 000Fh
OSCFRQ_FRQ0_POSN                         equ 0000h
OSCFRQ_FRQ0_POSITION                     equ 0000h
OSCFRQ_FRQ0_SIZE                         equ 0001h
OSCFRQ_FRQ0_LENGTH                       equ 0001h
OSCFRQ_FRQ0_MASK                         equ 0001h
OSCFRQ_FRQ1_POSN                         equ 0001h
OSCFRQ_FRQ1_POSITION                     equ 0001h
OSCFRQ_FRQ1_SIZE                         equ 0001h
OSCFRQ_FRQ1_LENGTH                       equ 0001h
OSCFRQ_FRQ1_MASK                         equ 0002h
OSCFRQ_FRQ2_POSN                         equ 0002h
OSCFRQ_FRQ2_POSITION                     equ 0002h
OSCFRQ_FRQ2_SIZE                         equ 0001h
OSCFRQ_FRQ2_LENGTH                       equ 0001h
OSCFRQ_FRQ2_MASK                         equ 0004h
OSCFRQ_FRQ3_POSN                         equ 0003h
OSCFRQ_FRQ3_POSITION                     equ 0003h
OSCFRQ_FRQ3_SIZE                         equ 0001h
OSCFRQ_FRQ3_LENGTH                       equ 0001h
OSCFRQ_FRQ3_MASK                         equ 0008h

// Register: OSCSTAT
#define OSCSTAT OSCSTAT
OSCSTAT                                  equ 00B2h
// bitfield definitions
OSCSTAT_PLLR_POSN                        equ 0000h
OSCSTAT_PLLR_POSITION                    equ 0000h
OSCSTAT_PLLR_SIZE                        equ 0001h
OSCSTAT_PLLR_LENGTH                      equ 0001h
OSCSTAT_PLLR_MASK                        equ 0001h
OSCSTAT_ADOR_POSN                        equ 0002h
OSCSTAT_ADOR_POSITION                    equ 0002h
OSCSTAT_ADOR_SIZE                        equ 0001h
OSCSTAT_ADOR_LENGTH                      equ 0001h
OSCSTAT_ADOR_MASK                        equ 0004h
OSCSTAT_SOR_POSN                         equ 0003h
OSCSTAT_SOR_POSITION                     equ 0003h
OSCSTAT_SOR_SIZE                         equ 0001h
OSCSTAT_SOR_LENGTH                       equ 0001h
OSCSTAT_SOR_MASK                         equ 0008h
OSCSTAT_LFOR_POSN                        equ 0004h
OSCSTAT_LFOR_POSITION                    equ 0004h
OSCSTAT_LFOR_SIZE                        equ 0001h
OSCSTAT_LFOR_LENGTH                      equ 0001h
OSCSTAT_LFOR_MASK                        equ 0010h
OSCSTAT_MFOR_POSN                        equ 0005h
OSCSTAT_MFOR_POSITION                    equ 0005h
OSCSTAT_MFOR_SIZE                        equ 0001h
OSCSTAT_MFOR_LENGTH                      equ 0001h
OSCSTAT_MFOR_MASK                        equ 0020h
OSCSTAT_HFOR_POSN                        equ 0006h
OSCSTAT_HFOR_POSITION                    equ 0006h
OSCSTAT_HFOR_SIZE                        equ 0001h
OSCSTAT_HFOR_LENGTH                      equ 0001h
OSCSTAT_HFOR_MASK                        equ 0040h
OSCSTAT_EXTOR_POSN                       equ 0007h
OSCSTAT_EXTOR_POSITION                   equ 0007h
OSCSTAT_EXTOR_SIZE                       equ 0001h
OSCSTAT_EXTOR_LENGTH                     equ 0001h
OSCSTAT_EXTOR_MASK                       equ 0080h

// Register: OSCEN
#define OSCEN OSCEN
OSCEN                                    equ 00B3h
// bitfield definitions
OSCEN_PLLEN_POSN                         equ 0000h
OSCEN_PLLEN_POSITION                     equ 0000h
OSCEN_PLLEN_SIZE                         equ 0001h
OSCEN_PLLEN_LENGTH                       equ 0001h
OSCEN_PLLEN_MASK                         equ 0001h
OSCEN_ADOEN_POSN                         equ 0002h
OSCEN_ADOEN_POSITION                     equ 0002h
OSCEN_ADOEN_SIZE                         equ 0001h
OSCEN_ADOEN_LENGTH                       equ 0001h
OSCEN_ADOEN_MASK                         equ 0004h
OSCEN_SOSCEN_POSN                        equ 0003h
OSCEN_SOSCEN_POSITION                    equ 0003h
OSCEN_SOSCEN_SIZE                        equ 0001h
OSCEN_SOSCEN_LENGTH                      equ 0001h
OSCEN_SOSCEN_MASK                        equ 0008h
OSCEN_LFOEN_POSN                         equ 0004h
OSCEN_LFOEN_POSITION                     equ 0004h
OSCEN_LFOEN_SIZE                         equ 0001h
OSCEN_LFOEN_LENGTH                       equ 0001h
OSCEN_LFOEN_MASK                         equ 0010h
OSCEN_MFOEN_POSN                         equ 0005h
OSCEN_MFOEN_POSITION                     equ 0005h
OSCEN_MFOEN_SIZE                         equ 0001h
OSCEN_MFOEN_LENGTH                       equ 0001h
OSCEN_MFOEN_MASK                         equ 0020h
OSCEN_HFOEN_POSN                         equ 0006h
OSCEN_HFOEN_POSITION                     equ 0006h
OSCEN_HFOEN_SIZE                         equ 0001h
OSCEN_HFOEN_LENGTH                       equ 0001h
OSCEN_HFOEN_MASK                         equ 0040h
OSCEN_EXTOEN_POSN                        equ 0007h
OSCEN_EXTOEN_POSITION                    equ 0007h
OSCEN_EXTOEN_SIZE                        equ 0001h
OSCEN_EXTOEN_LENGTH                      equ 0001h
OSCEN_EXTOEN_MASK                        equ 0080h

// Register: PRLOCK
#define PRLOCK PRLOCK
PRLOCK                                   equ 00B4h
// bitfield definitions
PRLOCK_PRLOCKED_POSN                     equ 0000h
PRLOCK_PRLOCKED_POSITION                 equ 0000h
PRLOCK_PRLOCKED_SIZE                     equ 0001h
PRLOCK_PRLOCKED_LENGTH                   equ 0001h
PRLOCK_PRLOCKED_MASK                     equ 0001h

// Register: SCANPR
#define SCANPR SCANPR
SCANPR                                   equ 00B5h
// bitfield definitions
SCANPR_PR_POSN                           equ 0000h
SCANPR_PR_POSITION                       equ 0000h
SCANPR_PR_SIZE                           equ 0003h
SCANPR_PR_LENGTH                         equ 0003h
SCANPR_PR_MASK                           equ 0007h
SCANPR_PR0_POSN                          equ 0000h
SCANPR_PR0_POSITION                      equ 0000h
SCANPR_PR0_SIZE                          equ 0001h
SCANPR_PR0_LENGTH                        equ 0001h
SCANPR_PR0_MASK                          equ 0001h
SCANPR_PR1_POSN                          equ 0001h
SCANPR_PR1_POSITION                      equ 0001h
SCANPR_PR1_SIZE                          equ 0001h
SCANPR_PR1_LENGTH                        equ 0001h
SCANPR_PR1_MASK                          equ 0002h
SCANPR_PR2_POSN                          equ 0002h
SCANPR_PR2_POSITION                      equ 0002h
SCANPR_PR2_SIZE                          equ 0001h
SCANPR_PR2_LENGTH                        equ 0001h
SCANPR_PR2_MASK                          equ 0004h
SCANPR_SCANPR_POSN                       equ 0000h
SCANPR_SCANPR_POSITION                   equ 0000h
SCANPR_SCANPR_SIZE                       equ 0003h
SCANPR_SCANPR_LENGTH                     equ 0003h
SCANPR_SCANPR_MASK                       equ 0007h
SCANPR_SCANPR0_POSN                      equ 0000h
SCANPR_SCANPR0_POSITION                  equ 0000h
SCANPR_SCANPR0_SIZE                      equ 0001h
SCANPR_SCANPR0_LENGTH                    equ 0001h
SCANPR_SCANPR0_MASK                      equ 0001h
SCANPR_SCANPR1_POSN                      equ 0001h
SCANPR_SCANPR1_POSITION                  equ 0001h
SCANPR_SCANPR1_SIZE                      equ 0001h
SCANPR_SCANPR1_LENGTH                    equ 0001h
SCANPR_SCANPR1_MASK                      equ 0002h
SCANPR_SCANPR2_POSN                      equ 0002h
SCANPR_SCANPR2_POSITION                  equ 0002h
SCANPR_SCANPR2_SIZE                      equ 0001h
SCANPR_SCANPR2_LENGTH                    equ 0001h
SCANPR_SCANPR2_MASK                      equ 0004h

// Register: DMA1PR
#define DMA1PR DMA1PR
DMA1PR                                   equ 00B6h
// bitfield definitions
DMA1PR_PR_POSN                           equ 0000h
DMA1PR_PR_POSITION                       equ 0000h
DMA1PR_PR_SIZE                           equ 0003h
DMA1PR_PR_LENGTH                         equ 0003h
DMA1PR_PR_MASK                           equ 0007h
DMA1PR_PR0_POSN                          equ 0000h
DMA1PR_PR0_POSITION                      equ 0000h
DMA1PR_PR0_SIZE                          equ 0001h
DMA1PR_PR0_LENGTH                        equ 0001h
DMA1PR_PR0_MASK                          equ 0001h
DMA1PR_PR1_POSN                          equ 0001h
DMA1PR_PR1_POSITION                      equ 0001h
DMA1PR_PR1_SIZE                          equ 0001h
DMA1PR_PR1_LENGTH                        equ 0001h
DMA1PR_PR1_MASK                          equ 0002h
DMA1PR_PR2_POSN                          equ 0002h
DMA1PR_PR2_POSITION                      equ 0002h
DMA1PR_PR2_SIZE                          equ 0001h
DMA1PR_PR2_LENGTH                        equ 0001h
DMA1PR_PR2_MASK                          equ 0004h
DMA1PR_DMA1PR_POSN                       equ 0000h
DMA1PR_DMA1PR_POSITION                   equ 0000h
DMA1PR_DMA1PR_SIZE                       equ 0003h
DMA1PR_DMA1PR_LENGTH                     equ 0003h
DMA1PR_DMA1PR_MASK                       equ 0007h
DMA1PR_DMA1PR0_POSN                      equ 0000h
DMA1PR_DMA1PR0_POSITION                  equ 0000h
DMA1PR_DMA1PR0_SIZE                      equ 0001h
DMA1PR_DMA1PR0_LENGTH                    equ 0001h
DMA1PR_DMA1PR0_MASK                      equ 0001h
DMA1PR_DMA1PR1_POSN                      equ 0001h
DMA1PR_DMA1PR1_POSITION                  equ 0001h
DMA1PR_DMA1PR1_SIZE                      equ 0001h
DMA1PR_DMA1PR1_LENGTH                    equ 0001h
DMA1PR_DMA1PR1_MASK                      equ 0002h
DMA1PR_DMA1PR2_POSN                      equ 0002h
DMA1PR_DMA1PR2_POSITION                  equ 0002h
DMA1PR_DMA1PR2_SIZE                      equ 0001h
DMA1PR_DMA1PR2_LENGTH                    equ 0001h
DMA1PR_DMA1PR2_MASK                      equ 0004h

